
&НаКлиенте
Процедура ПрикрепитьФайл(Команда)
	ДиалогВыбора = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Если ДиалогВыбора.Выбрать() Тогда 		
		//НовоеВложение = Объект.Вложения.Добавить();
		//НовоеВложение.ПутьКФайлу = ДиалогВыбора.ПолноеИмяФайла;
		//ДиалогВыбора.ПолноеИмяФайла
		//ИмяФайла = СформироватьИмяФайлаНаСервере(ДиалогВыбора.ПолноеИмяФайла);
		
		
		СтруктураОтбора = Новый Структура;
		СтруктураОтбора.Вставить("ИмяФайла", СтрЗаменить(ДиалогВыбора.ПолноеИмяФайла,ДиалогВыбора.Каталог,""));
		СтруктураОтбора.Вставить("ПутьКФайлу",ДиалогВыбора.ПолноеИмяФайла); 
		НайденныеПрикрепленныеФайлы = Объект.ПрикрепленныеФайлы.НайтиСтроки(СтруктураОтбора);
		Если НайденныеПрикрепленныеФайлы.Количество()>0 Тогда 
			Сообщить("Данный файл '" + ДиалогВыбора.ПолноеИмяФайла + "' уже есть в списке прикрепленных!");
		Иначе
			НовыйФайл = Объект.ПрикрепленныеФайлы.Добавить();
			НовыйФайл.ИмяФайла = СтрЗаменить(ДиалогВыбора.ПолноеИмяФайла,ДиалогВыбора.Каталог,"");
			НовыйФайл.ПутьКФайлу = ДиалогВыбора.ПолноеИмяФайла;
		КонецЕсли;
		
		//СохранитьФайлНаСервере(ДиалогВыбора.ПолноеИмяФайла);
		
		
		
		
		//ПутьСохраненияФайла = ПутьКХранилищуФайлов+"\"+ИмяФайла;
		//ХранилищеФайла = Новый ХранилищеЗначения(Вложение.Данные);
		//ДвоичныеДанные = ХранилищеФайла.Получить();
		//ДвоичныеДанные.Записать(ПутьСохраненияФайла);
		//НовыйФайл = НоваяЗаявка.Вложения.Добавить();	
		//НовыйФайл.ПутьКФайлу = ПутьСохраненияФайла;	
		//ТекстЗаявки = СтрЗаменить(ТекстЗаявки,"cid:"+Вложение.Идентификатор,ПутьСохраненияФайла);
		
		
		
	КонецЕсли;
КонецПроцедуры

Функция СформироватьИмяФайлаНаСервере(ИмяФайла)
	Возврат ОбщийФайлы.СформироватьИмяФайла(ИмяФайла);	
КонецФункции  

&НаСервере
Процедура СохранитьФайлНаСервере(ИмяФайла)
	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	ДокументОбъект.СохранитьФайлНаСервере(ИмяФайла,Объект.Номер);
КонецПроцедуры

&НаСервере
Процедура ОтправитьОтветНаСервере()	
	ТекущийПользователь = ПользователиИнформационнойБазы.ТекущийПользователь();	
		
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьОтвет(Команда)
	ОтправитьОтветНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФайл(Команда)
	ЗапуститьПриложение(Объект.ПрикрепленныеФайлы[ЭтаФорма.Элементы.ПрикрепленныеФайлы.ТекущаяСтрока].ПутьКФайлу);
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Для каждого стрФайл Из Объект.ПрикрепленныеФайлы Цикл 
		
		
	КонецЦикла;
КонецПроцедуры






