
Процедура СохранитьНастройки(СохраняемыйОбъект, СохраняемоеЗначение) Экспорт 
	КлючОбъекта = СохраняемыйОбъект;
	КлючНастроек = СохраняемыйОбъект;
	ОписаниеНастроек = СохраняемыйОбъект;
	ИмяПользователя = ПользователиИнформационнойБазы.ТекущийПользователь();
	Настройки = Новый Соответствие;
	Настройки.Вставить(СохраняемыйОбъект,СохраняемоеЗначение);
	ХранилищеОбщихНастроек.Сохранить(КлючОбъекта, КлючНастроек, Настройки, ОписаниеНастроек, ИмяПользователя);
КонецПроцедуры

Функция ВосстановитьНастройки(ЗагружаемыйОбъект) Экспорт
	КлючОбъекта = ЗагружаемыйОбъект;
	КлючНастроек = ЗагружаемыйОбъект;
	ОписаниеНастроек = ЗагружаемыйОбъект;
	ИмяПользователя = ПользователиИнформационнойБазы.ТекущийПользователь();
	Возврат ХранилищеОбщихНастроек.Загрузить(КлючОбъекта, КлючНастроек, ОписаниеНастроек, ИмяПользователя);
КонецФункции

Процедура ЗаполнитьНастройками(Объект, Настройки) Экспорт
	Для каждого Элемент Из Настройки Цикл 
		Объект[Элемент.Ключ] = Элемент.Значение;					
	КонецЦикла;
КонецПроцедуры

