
&НаСервере
Процедура ЗагрузитьЗаявкиНаСервере() Экспорт
	мПараметры = ОбщийПодключение.ПолучитьПараметрыПодключения();
	Профиль = Новый ИнтернетПочтовыйПрофиль;
	Профиль.Пользователь = мПараметры.Пользователь;
	Профиль.Пароль = мПараметры.Пароль;
	Профиль.АдресСервераPOP3 = мПараметры.АдресСервера;
	ПРофиль.АутентификацияPOP3 = СпособPOP3Аутентификации.Обычная;
	МассивПисем = Новый массив();
	Попытка
		Почта = Новый ИнтернетПочта;
		Почта.Подключиться(Профиль);
		ОбработатьЗаявки(Почта.Выбрать(Ложь));
	Исключение
		Сообщить("Ошибка получения почты " + ОписаниеОшибки());
	КонецПопытки;
КонецПроцедуры

&НаСервере
Процедура ОбработатьЗаявки(МассивПисем)
	МассивEmail = ПолучитьEmailПользователей();
	Для каждого стрПисьмо Из МассивПисем Цикл 
		Сообщить(стрПисьмо.Отправитель.Адрес);
		Если МассивEmail.Найти(стрПисьмо.Отправитель.Адрес)<>Неопределено Тогда 		
			СоздатьНовуюЗаявку(стрПисьмо);
		КонецЕсли;
	КонецЦикла;	
КонецПроцедуры

&НаСервере
Функция ПолучитьEmailПользователей();
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Пользователи.Email КАК Email
		|ИЗ
		|	Справочник.Пользователи КАК Пользователи";
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	МассивПользователей = Новый Массив;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		МассивПользователей.Добавить(ВыборкаДетальныеЗаписи.Email);
	КонецЦикла;
	Возврат МассивПользователей;
КонецФункции

&НаСервере
Процедура СоздатьНовуюЗаявку(Письмо)
	Для каждого ЭлементТекста Из Письмо.Тексты Цикл 
		Если ЭлементТекста.ТипТекста = ТипТекстаПочтовогоСообщения.HTML Тогда 
			ТекстЗаявки = ЭлементТекста.Текст;
		КонецЕсли;
	КонецЦикла;
	ТекстЗаявки = ОбщийЗаявки.ПреобразоватьТекстЗаявки(ТекстЗаявки);
	НоваяЗаявка = Документы.Заявки.СоздатьДокумент();
	НоваяЗаявка.Дата = Письмо.ДатаПолучения;
	НоваяЗаявка.Записать();//Номер для присваивания каталога для хранения файлов
	СоздатьКаталог(ПутьКХранилищуФайлов+"\"+НоваяЗаявка.Номер);
	НоваяЗаявка.ТемаЗаявки = ОбщийЗаявки.ПреобразоватьТемуЗаявки(Письмо.Тема);
	НоваяЗаявка.Инициатор = ОбщийЗаявки.НайтиИнициатораЗаявки(ТекстЗаявки);
	НоваяЗаявка.СтатусЗаявки = Перечисления.СтатусыЗаявок.Необработана;
	НоваяЗаявка.Приоритет = ОбщийЗаявки.ПолучитьПоследнююПриоритет()+1;
	
	Счетчик=0;
	Для каждого Вложение Из Письмо.Вложения Цикл 
		ПутьСохраненияФайла = ПутьКХранилищуФайлов+"\"+НоваяЗаявка.Номер+"\"+Вложение.ИмяФайла;
		ХранилищеФайла = Новый ХранилищеЗначения(Вложение.Данные);
		ДвоичныеДанные = ХранилищеФайла.Получить();
		ДвоичныеДанные.Записать(ПутьСохраненияФайла);
		НовыйФайл = НоваяЗаявка.ПрикрепленныеФайлы.Добавить();	
		НовыйФайл.ПутьКФайлу = ПутьСохраненияФайла;	
		НовыйФайл.ИмяФайла = Вложение.ИмяФайла;			
		ТекстЗаявки = СтрЗаменить(ТекстЗаявки,"cid:"+Вложение.Идентификатор,ПутьСохраненияФайла);
	КонецЦикла;
	
	НоваяЗаявка.ТелоЗаявки = ТекстЗаявки;	
	НоваяЗаявка.Записать();
КонецПроцедуры








