

Функция ПолучитьПараметрыПодключения() Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	НастройкиПодключения.Пользователь КАК Пользователь,
	|	НастройкиПодключения.Пароль КАК Пароль,
	|	НастройкиПодключения.АдресСервера КАК АдресСервера
	|ИЗ
	|	Справочник.НастройкиПодключения КАК НастройкиПодключения";
	ТаблицаРезультат = Запрос.Выполнить().Выгрузить();
	Если ТаблицаРезультат.Количество()>0 Тогда 
		СтруктураПодключения = Новый Структура;
		Для каждого стрТаблицы Из ТаблицаРезультат Цикл 
			СтруктураПодключения.Вставить("Пользователь",стрТаблицы.Пользователь); 	
			СтруктураПодключения.Вставить("Пароль",стрТаблицы.Пароль); 	
			СтруктураПодключения.Вставить("АдресСервера",стрТаблицы.АдресСервера); 	
		КонецЦикла;
		Возврат СтруктураПодключения;	
	КонецЕсли;	
КонецФункции
