
&НаКлиенте
Процедура ЗагрузитьЗаявки(Команда)
	ЗагрузитьЗаявкиНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьЗаявкиНаСервере()
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.ЗагрузитьЗаявкиНаСервере();	
КонецПроцедуры

&НаСервере
Процедура ПриОткрытииНаСервере()
	Объект.ПутьКХранилищуФайлов = Справочники.Константы.ПутьДляСохраненияФайла.Значение;	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПриОткрытииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПередЗакрытиемНаСервере()
	ОбщийНастройки.СохранитьНастройки("ПутьКХранилищуФайлов", Объект.ПутьКХранилищуФайлов);
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	ПередЗакрытиемНаСервере();
КонецПроцедуры

	
	
	
	
	
